trade_exp/src/Documents/РейсСиламиПоставщика/РейсСиламиПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5bf82e73-7ab1-45bf-b862-fb5b6c6a88ca">
  <name>РейсСиламиПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="44cf9367-fa27-43f2-b5f6-e865a768535a">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6855db2e-fadc-4931-b26d-d3babf2b2386">
    <name>Автомобиль</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1bb483f1-bda5-4cff-b3ae-2eeccc5ed72d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7f6f4ed0-3c87-42ca-a340-824eee881375">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="499f89e5-e247-4cbb-b287-4669a9057932">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4673add5-4f59-49b3-8d5a-d1b552b2ba5c">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dd91057b-9750-4fa2-9f1e-07221568bf73">
    <name>СтоимостьТовара</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="426b44a6-144f-4e89-9b57-dd42e205630b">
    <name>КоличествоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7ca02de9-ea5f-4df1-b33d-2fc0cabb7003">
    <name>НачалоВыполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="65fb697b-d091-4d48-b593-804e3fc80c0f">
    <name>ДатаПрибытияНаСклад</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8f4d143e-213c-4531-a3ad-d309ec58f76f">
    <name>Стоимость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="861bc191-79f7-43af-bc3b-24a0dabad2b4">
    <name>Основания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="aeb236a5-5252-4a35-b0fe-696c9738d591">
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="308a66c9-8640-4f0b-9dd4-b9e234772248">
      <name>Приобретение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="46f06fe2-991f-415b-9d3d-5013cc43a9c8">
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1c493b73-b173-4b6d-8a15-dec6117f8348">
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="1683c530-8a9f-46e3-a41d-432431d33d9a">
    <name>ГруппаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0f81bb31-85fa-43a9-975e-7162ecf07fd8">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a8540aa-05a4-46e1-8b0e-6c5864426864">
      <name>Норматив</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a745065e-2078-4b3f-9b56-0041d5f058b6">
      <name>Секция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="127d2c69-2fff-4ee8-9767-5dc1330559c2">
      <name>ПримечаниеКПоставке</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1cc74222-9dc5-4cc2-a2f6-577b578a2156">
      <name>ДатаРазгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ffc9b0cc-ff47-428a-8153-7ce570c7f5e2">
      <name>ВремяПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cf668fdf-759b-473c-907b-0c3a442b3258">
      <name>ПродолжительностьРазгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cbfc4f32-a1bf-4bc0-969a-844b394d6867">
      <name>СогласованоСоСкладом</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5928b091-ea44-4c40-9d87-187b639263db">
      <name>ОбъемПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="866ad587-5e51-4ddd-b4c1-46cceb9fa793">
      <name>ВесПоставки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aeeb67df-2c2d-43ef-b0c7-c7a48082aed6">
      <name>ФактическоеВремяПрибытия</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b60c94bd-5be6-4593-b46e-39c67a4ce415">
      <name>НачалоПогрузкиКПП</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2e4bd777-95a7-460c-aa48-fda63308380a">
      <name>ОкончаниеПогрузкиКПП</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9909c50-ebe2-4815-b32e-e021003a12b7">
      <name>Эстакада</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ГрафикПоставокНаСклад/ГрафикПоставокНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b705356a-3674-4009-9b19-325f4f8d31b5">
  <name>ГрафикПоставокНаСклад</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="76b53ffb-1cb8-4f02-8672-d6fb75f950f8">
    <name>Поток</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="7d8d9c96-2e82-42e6-9eaa-77e664a95aa0">
    <name>ДатаВремяРазгрузкиПлан</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="554d2043-23c2-4d8a-8d1f-7673b049aace">
    <name>ПродолжительностьРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="26c907b0-a3c4-480d-b8cf-9e1a032a4aea">
    <name>ДатаВремяПриездаФакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b09375dc-860d-4367-bc6f-b6ac98e85b4a">
    <name>КоличествоИспользуется</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="2e92b9a3-164e-497a-a5c9-88c89460f830">
    <name>АвторИзменений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dcbd2790-7240-447e-8d1d-bbebc3396ef2">
    <name>СогласованоСоСкладом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4a7ccbc1-15a7-4f8d-a54f-41f83a07c417">
    <name>ТекстПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="4e117ade-5a52-4e6e-9ee4-f1a871bf22bd">
    <name>ЗаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c96af1ba-579e-4dd9-8e21-ed2ba80d3cad">
    <name>Оборудование</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Catalogs/ПотокиТранспортныхСредствПоставкиНаСклад/ПотокиТранспортныхСредствПоставкиНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="735c9797-25e5-44eb-8f8a-1633c6be5ce1">
  <name>ПотокиТранспортныхСредствПоставкиНаСклад</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3c2491b2-2a6c-4b6c-a71a-05c1ee467c74">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3cc493c5-f400-4b1b-a013-3158d1b54643">
    <name>ПотокАктивный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="1edd5cde-e02e-4d4c-8065-0c671bbd8ff7">
    <name>Секции</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="203168ef-32cb-4993-9d9d-f84699c6dd7a">
      <name>Секция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Documents/РейсСиламиПоставщика/Forms/ФормаДокумента/Module.bsl
#Область СобытияФормы
&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	Документы.РейсСиламиПоставщика.ЗаполнитьВесОбъемОснований(Объект);
	Объект.Вес = Объект.Основания.Итог("Вес");
	Объект.Объем = Объект.Основания.Итог("Объем");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Документы.РейсСиламиПоставщика.ОбновитьВремяИИнтервалПоставки(Объект);
	//Записать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПроверитьИзменениеСеткиПоставок();
	ЗаполнитьПотокиПоСкладам();
	
	Документы.РейсСиламиПоставщика.ЗаполнитьВесОбъемОснований(Объект);
	Объект.Вес = Объект.Основания.Итог("Вес");
	Объект.Объем = Объект.Основания.Итог("Объем");
КонецПроцедуры

&НаКлиенте
Процедура ОснованияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОснованияПриОкончанииРедактированияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОснованияПриобретениеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ТекущаяСтрока = Элементы.Основания.ТекущиеДанные;
	ТекущаяСтрока.Документ = ПолучитьЗаказПоставщикуПоПриобретению(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура ОснованияПриОкончанииРедактированияНаСервере()
	Документы.РейсСиламиПоставщика.ЗаполнитьДанныеПоОснованию(Неопределено, Объект);
	ЗаполнитьПотокиПоСкладам();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ОбновитьДанныеНаСервере();
КонецПроцедуры
&НаСервере
Процедура ОбновитьДанныеНаСервере()
	Документы.РейсСиламиПоставщика.ОбновитьИтогиПоОснованиям(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ВодительПриИзмененииНаСервере();
КонецПроцедуры
&НаСервере
Процедура ВодительПриИзмененииНаСервере()
	ПараметрыЗаполнения= Документы.ЗаданиеНаПеревозкуРейс.ПолучитьПараметрыЗаполненияПоВодителю(Объект.Водитель);
	Если ПараметрыЗаполнения <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыЗаполнения);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧОснований
&НаКлиенте
Процедура ОснованияПриИзменении(Элемент)
	ОбновитьДанныеПоОснованиямНаСервере();
КонецПроцедуры
&НаСервере
Процедура ОбновитьДанныеПоОснованиямНаСервере()
	Если Объект.Основания.Количество() = 1 Тогда 
		Основание= Объект.Основания[0].Документ;
		Документы.РейсСиламиПоставщика.ЗаполнитьДанныеПоОснованию(Основание, Объект);
	КонецЕсли;
	Документы.РейсСиламиПоставщика.ОбновитьИтогиПоОснованиям(Объект);
	ЗаполнитьПотокиПоСкладам();
	ПроверитьИзменениеСеткиПоставок();
КонецПроцедуры
#КонецОбласти

#Область ГруппаПоставки

&НаКлиенте
Процедура ПредупредитьПользователя(ТекстОповещения)
	ПоказатьОповещениеПользователя("Сетка поставок | заказ "+ Объект.Номер, ПолучитьНавигационнуюСсылку(Объект.Ссылка), ТекстОповещения, БиблиотекаКартинок.ИсторияДанных, СтатусОповещенияПользователя.Важное); 
КонецПроцедуры

&НаКлиенте
Процедура ПресчитатьСекциюНаКлиенте(Команда)
	СекцияИзменилась = Ложь;
	МассивСкладов = Новый массив;
	ИдентификаторыВыделенныхСтрок = Элементы.ГруппаПоставки.ВыделенныеСтроки;
	
	Для каждого Идентификатор из ИдентификаторыВыделенныхСтрок Цикл
		ТекущаяСтрока = Объект.ГруппаПоставки.НайтиПоИдентификатору(Идентификатор);
		МассивСкладов.Добавить(ТекущаяСтрока.Склад);
	КонецЦикла;
	
	ПресчитатьСекцию(СекцияИзменилась, МассивСкладов);
	Если СекцияИзменилась Тогда 
		ПредупредитьПользователя("Секция изменилась. Запланируйте новое время в сетке");
		ДанныеПоставкиИзменились = Истина;
	КонецЕсли;
	
	ПересчитатьПоНормативу(ИдентификаторыВыделенныхСтрок);
КонецПроцедуры

&НаСервере
Процедура ПресчитатьСекцию(СекцияИзменилась, Склады = Неопределено)
	
	РезультатЗапроса = Документы.ЗаданиеНаПеревозкуРейс.ПолучитьДанныеПоСкладамИСекциям(Объект, Склады);
	ВыборкаИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаИтог.Следующий() Тогда
		СтрокиТекущегоСклада = Объект.ГруппаПоставки.НайтиСтроки(Новый Структура("Склад", ВыборкаИтог.Склад));
		Выборка = ВыборкаИтог.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ВыборкаИтог.ОбъемПоСекции = Выборка.ОбъемПоСекции Тогда
				СекцияБыла = СтрокиТекущегоСклада[0].Секция;
				СтрокиТекущегоСклада[0].Секция = Выборка.Секция;
				 
				Если СекцияБыла <> СтрокиТекущегоСклада[0].Секция Тогда		
					ВремяПоступления = '00010101000000';//
					СекцияИзменилась = Истина;
				КонецЕсли;
				Модифицированность = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборВремениВручнуюНаКлиенте(Команда)
	ИдентификаторыВыделенныхСтрок = Элементы.ГруппаПоставки.ВыделенныеСтроки;
	Если ИдентификаторыВыделенныхСтрок.Количество()>1 Тогда
		Сообщить("Необходимо выделить одну строку для выбора времени вручную");
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ГруппаПоставки.ТекущиеДанные;
	Если ТекущаяСтрока.ПродолжительностьРазгрузки = 0 Тогда
		Сообщить("Укажите ненулевую длительность погрузки!");
		Возврат;
	КонецЕсли;
	
	//записать изменения
	Если Модифицированность Тогда
		//Предупреждение("Документ будет записан!",2,"Изменения в поставке");
		Если Объект.Проведен Тогда
			ЭтотОбъект.Записать();
		Иначе
			Сообщить("Документ требуется провести!");
			Возврат;
		КонецЕсли;
		ЗаписатьИнтервалДоставкиСервер(ТекущаяСтрока.ПолучитьИдентификатор());
	КонецЕсли;
	Если ТекущаяСтрока.Секция <> ПредопределенноеЗначение("Справочник.РабочиеУчастки.ПустаяСсылка") Тогда
		ПараметрыОткрытияФормыПодбора = Новый Структура;
		ПараметрыОткрытияФормыПодбора.Вставить("Период", ?(ТекущаяСтрока.ДатаРазгрузки=Дата(1,1,1), ТекущаяДата(), ТекущаяСтрока.ДатаРазгрузки));
		ПараметрыОткрытияФормыПодбора.Вставить("Секция", ТекущаяСтрока.Секция);
		ПараметрыОткрытияФормыПодбора.Вставить("ИзФормыЗаказа", Истина);
		ПараметрыОткрытияФормыПодбора.Вставить("ПродолжительностьРазгрузки", ТекущаяСтрока.ПродолжительностьРазгрузки);
		ПараметрыОткрытияФормыПодбора.Вставить("ЗаказПоставщику", Объект.Ссылка);
		ПараметрыОткрытияФормыПодбора.Вставить("КомментарийКПоставке", ТекущаяСтрока.ПримечаниеКПоставке);
		
		СписокДопРесурсов = Новый СписокЗначений;
		Если ТекущаяСтрока.Эстакада Тогда
			СписокДопРесурсов.Добавить(ПолучитьЭстакаду(Истина));
		Иначе
			СписокДопРесурсов.Добавить(ПолучитьЭстакаду(Ложь));
		КонецЕсли;
		ПараметрыОткрытияФормыПодбора.Вставить("ДополнительныеРесурсы", СписокДопРесурсов);
		
		ПараметрыОткрытияФормыПодбора.Вставить("Оборудование", ?(ТекущаяСтрока.Эстакада, ПолучитьЭстакаду(Истина), ПолучитьЭстакаду(Ложь))); 
		//ПараметрыОткрытияФормыПодбора.Вставить("НельзяВыбиратьДату", ЕстьРейсПоПоставке());
		
		//ОткрытьФорму("Обработка.ПланировщикПоставокНаСклад.Форма", ПараметрыОткрытияФормыПодбора, ЭтаФорма,,,,Новый ОписаниеОповещения("ОбновитьДанныеПоставкиПослеЗакрытияПланировщика", ЭтотОбъект));
		ОчиститьСообщения();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоставкиПослеЗакрытияПланировщика(Результат=Неопределено, ДополнительныеПараметры=Неопределено) Экспорт
	Документы.РейсСиламиПоставщика.ОбновитьВремяИИнтервалПоставки(Объект);
	Записать();
КонецПроцедуры

&НаСервере
Функция ПолучитьЭстакаду(НеПустая)
	Если НеПустая Тогда
		Возврат Справочники.ТехническиеРесурсыСклада.НайтиПоКоду("000000001");
	Иначе 
		Возврат Справочники.ТехническиеРесурсыСклада.ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаписатьИнтервалДоставкиСервер(ИдентицикаторТекущейСтроки = Неопределено)
	ЗаполнитьПотокиПоСкладам();
	
	Если ИдентицикаторТекущейСтроки=Неопределено Тогда
		Для каждого Строка из Объект.ГруппаПоставки Цикл
			ЗаписатьИнтервалДоставки(Строка);
		КонецЦикла;
	Иначе
		ЗаписатьИнтервалДоставки(Объект.ГруппаПоставки.НайтиПоИдентификатору(ИдентицикаторТекущейСтроки));
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьИнтервалДоставки(ТекущаяСтрока)
	
	Если //ДанныеПоставкиИзменились И 
		Альтерра_СеткаПоставок.ЕстьСекцииУСклада(ТекущаяСтрока.Склад) Тогда
		ПараметрыЗаписи = Новый Соответствие;
		ОсновнойПоток = ПолучитьПотокПоСекции(ТекущаяСтрока.Секция);
		ЗначениеПараметров = Новый Структура;
		ЗначениеПараметров.Вставить("Поток", ОсновнойПоток);
		ЗначениеПараметров.Вставить("ЗаказПоставщику", Объект.Ссылка);
		ЗначениеПараметров.Вставить("ДатаВремяРазгрузкиПлан", ТекущаяСтрока.ДатаРазгрузки + Минута(ТекущаяСтрока.ВремяПоступления)*60 + Час(ТекущаяСтрока.ВремяПоступления)*3600);
		ЗначениеПараметров.Вставить("ПродолжительностьРазгрузки", ТекущаяСтрока.ПродолжительностьРазгрузки);
		ЗначениеПараметров.Вставить("СогласованоСоСкладом", ТекущаяСтрока.СогласованоСоСкладом);
		ЗначениеПараметров.Вставить("ТекстПоставки", ТекущаяСтрока.ПримечаниеКПоставке);
		ЗначениеПараметров.Вставить("Склад", ТекущаяСтрока.Склад);
		ЗначениеПараметров.Вставить("Оборудование", ?(ТекущаяСтрока.Эстакада, ПолучитьЭстакаду(Истина), ПолучитьЭстакаду(Ложь)));
		ПараметрыЗаписи.Вставить(Объект.Ссылка, ЗначениеПараметров);
		//Альтерра_СеткаПоставок.ИзменитьДанныеСеткиПоставок(Объект.Ссылка, "Новое",  ПараметрыЗаписи, Истина, ТекущаяСтрока.Склад, Альтерра_СеткаПоставок.ПолучитьДопПотокиПоСкладу(ТекущаяСтрока.Склад, Объект.Ссылка, ОсновнойПоток));
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьПоНормативуНаКлиенте(Команда)
	ИдентификаторыВыделенныхСтрок = Элементы.ГруппаПоставки.ВыделенныеСтроки;
	ПересчитатьПоНормативу(ИдентификаторыВыделенныхСтрок);
КонецПроцедуры

&НаСервере
Процедура ПересчитатьПоНормативу(ИдентификаторыВыделенныхСтрок = Неопределено)
	МассивСкладовИНормативов = Новый ТаблицаЗначений;
	МассивСкладовИНормативов.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	МассивСкладовИНормативов.Колонки.Добавить("Норматив", Новый ОписаниеТипов("СправочникСсылка.НормативыПриемкиПоставкиНаСклад"));
	МассивСкладовИНормативов.Колонки.Добавить("Поток", Новый ОписаниеТипов("СправочникСсылка.ПотокиТранспортныхСредствПоставкиНаСклад"));
	МассивСкладовИНормативов.Колонки.Добавить("ДатаНачалаИнтервала", Новый ОписаниеТипов("Дата"));
	МассивСкладовИНормативов.Колонки.Добавить("ДатаОкончанияИнтервала", Новый ОписаниеТипов("Дата"));
	МассивСкладовИНормативов.Колонки.Добавить("ПродолжительностьРазгрузки", Новый ОписаниеТипов("Число"));
	МассивСкладовИНормативов.Колонки.Добавить("Эстакада", Новый ОписаниеТипов("Булево"));
	
	Для каждого Идентификатор из ИдентификаторыВыделенныхСтрок Цикл
		ТекущаяСтрока = Объект.ГруппаПоставки.НайтиПоИдентификатору(Идентификатор);
		НоваяСтрока = МассивСкладовИНормативов.Добавить();//поправить ТЗ
		НоваяСтрока.Склад = ТекущаяСтрока.Склад;
		НоваяСтрока.Норматив = ТекущаяСтрока.Норматив;
		НоваяСтрока.Поток = ТекущаяСтрока.Поток;
		НоваяСтрока.ДатаНачалаИнтервала = ТекущаяСтрока.ДатаРазгрузки;
		НоваяСтрока.ДатаОкончанияИнтервала = ТекущаяСтрока.ДатаРазгрузки+ТекущаяСтрока.ПродолжительностьРазгрузки;
		НоваяСтрока.ПродолжительностьРазгрузки = ТекущаяСтрока.ПродолжительностьРазгрузки;
		НоваяСтрока.Эстакада = ТекущаяСтрока.Эстакада;
	КонецЦикла;
	Документы.РейсСиламиПоставщика.ЗаполнитьПоНормативу(Объект, , МассивСкладовИНормативов);
	ДанныеПоставкиИзменились = Истина;
	ПроверитьИнтервалыСкладовНаДоступность(МассивСкладовИНормативов);
КонецПроцедуры

&НаСервере
Процедура ПроверитьИнтервалыСкладовНаДоступность(МассивСкладовИНормативов)
	
	ЗаполнитьПотокиПоСкладам();
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("ИнтервалДоступен", Истина);
	РезультатПроверки.Вставить("СброситьВремя", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Рейс КАК Рейс,
	|	ТЧ.Склад КАК Склад,
	|	ТЧ.ДатаНачалаИнтервала КАК ДатаНачалаИнтервала,
	|	ТЧ.ДатаОкончанияИнтервала КАК ДатаОкончанияИнтервала,
	|	ТЧ.Поток КАК Поток,
	|	ТЧ.Эстакада КАК Эстакада
	|ПОМЕСТИТЬ втРесурсыДокумента
	|ИЗ
	|	&СписокОборудования КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ГрафикПоставокНаСкладСрезПоследних.Поток КАК Поток,
	|	втРесурсыДокумента.Склад КАК Склад,
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан КАК НачалоИнтервала,
	|	ДОБАВИТЬКДАТЕ(ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан, МИНУТА, ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки) КАК КонецИнтервала,
	|	""Занятый интервал"" КАК Причина
	|ПОМЕСТИТЬ ВТЗанятыеИнтервалы
	|ИЗ
	|	РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних КАК ГрафикПоставокНаСкладСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРесурсыДокумента КАК втРесурсыДокумента
	|		ПО ГрафикПоставокНаСкладСрезПоследних.Поток = втРесурсыДокумента.Поток
	|			И (НЕ ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику = втРесурсыДокумента.Рейс)
	|
	|ГДЕ
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан <> &ПустаяДата
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику,
	|	ГрафикПоставокНаСкладСрезПоследних.Поток,
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан,
	|	ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки,
	|	втРесурсыДокумента.ДатаНачалаИнтервала,
	|	втРесурсыДокумента.ДатаОкончанияИнтервала,
	|	втРесурсыДокумента.Склад
	|
	|ИМЕЮЩИЕ
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан МЕЖДУ втРесурсыДокумента.ДатаНачалаИнтервала И ДОБАВИТЬКДАТЕ(втРесурсыДокумента.ДатаОкончанияИнтервала, СЕКУНДА, -1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику КАК ЗаказПоставщику,
	|	втРесурсыДокумента.Склад КАК Склад,
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан КАК ДатаВремяРазгрузкиПлан,
	|	ДОБАВИТЬКДАТЕ(ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан, МИНУТА, ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки) КАК ДатаВремяОкончанияРазгрузки,
	|	ГрафикПоставокНаСкладСрезПоследних.Оборудование КАК Оборудование,
	|	ВЫБОР
	|		КОГДА НЕ ГрафикПоставокНаСкладСрезПоследних.Оборудование = ЗНАЧЕНИЕ(Справочник.ТехническиеРесурсыСклада.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЭстакадаРегистр,
	|	ВЫБОР
	|		КОГДА втРесурсыДокумента.Эстакада
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЭстакадаДокумент,
	|	""Эстакада"" КАК Причина
	|ПОМЕСТИТЬ ВТЭстакада
	|ИЗ
	|	РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних КАК ГрафикПоставокНаСкладСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПотокиТранспортныхСредствПоставкиНаСклад.Секции КАК ПотокиТранспортныхСредствПоставкиНаСкладСекции
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеУчастки КАК РабочиеУчастки
	|				ЛЕВОЕ СОЕДИНЕНИЕ втРесурсыДокумента КАК втРесурсыДокумента
	|				ПО РабочиеУчастки.Владелец = втРесурсыДокумента.Склад
	|			ПО ПотокиТранспортныхСредствПоставкиНаСкладСекции.Секция = РабочиеУчастки.Ссылка
	|		ПО ГрафикПоставокНаСкладСрезПоследних.Поток = ПотокиТранспортныхСредствПоставкиНаСкладСекции.Ссылка
	|
	|ГДЕ
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан <> &ПустаяДата
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику,
	|	втРесурсыДокумента.Склад,
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан,
	|	ГрафикПоставокНаСкладСрезПоследних.Оборудование,
	|	втРесурсыДокумента.Эстакада,
	|	втРесурсыДокумента.ДатаНачалаИнтервала,
	|	втРесурсыДокумента.ДатаОкончанияИнтервала,
	|	ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки
	|
	|ИМЕЮЩИЕ
	|	(ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан МЕЖДУ втРесурсыДокумента.ДатаНачалаИнтервала И ДОБАВИТЬКДАТЕ(втРесурсыДокумента.ДатаОкончанияИнтервала, СЕКУНДА, -1)
	|		ИЛИ ДОБАВИТЬКДАТЕ(ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан, МИНУТА, ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки) МЕЖДУ втРесурсыДокумента.ДатаНачалаИнтервала И ДОБАВИТЬКДАТЕ(втРесурсыДокумента.ДатаОкончанияИнтервала, СЕКУНДА, -1)
	|		ИЛИ втРесурсыДокумента.ДатаНачалаИнтервала МЕЖДУ ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан И ДОБАВИТЬКДАТЕ(ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан, МИНУТА, ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки)
	|		ИЛИ втРесурсыДокумента.ДатаОкончанияИнтервала МЕЖДУ ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан И ДОБАВИТЬКДАТЕ(ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан, МИНУТА, ГрафикПоставокНаСкладСрезПоследних.ПродолжительностьРазгрузки)) И
	|	ВЫБОР
	|		КОГДА НЕ ГрафикПоставокНаСкладСрезПоследних.Оборудование = ЗНАЧЕНИЕ(Справочник.ТехническиеРесурсыСклада.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ = ВЫБОР
	|		КОГДА втРесурсыДокумента.Эстакада
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ И
	|	ВЫБОР
	|		КОГДА втРесурсыДокумента.Эстакада
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗанятыеИнтервалы.Склад КАК Склад,
	|	ВТЗанятыеИнтервалы.Причина КАК Причина
	|ИЗ
	|	ВТЗанятыеИнтервалы КАК ВТЗанятыеИнтервалы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТЭстакада.Склад,
	|	ВТЭстакада.Причина
	|ИЗ
	|	ВТЭстакада КАК ВТЭстакада";
		
	Запрос.УстановитьПараметр("Рейс", Объект.Ссылка);
	Запрос.УстановитьПараметр("СписокОборудования", МассивСкладовИНормативов);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекущиеСтроки = Объект.ГруппаПоставки.НайтиСтроки(Новый Структура("Склад", ВыборкаДетальныеЗаписи.Склад));
		Если ТекущиеСтроки.Количество() > 0 Тогда
			ТекущаяСтрока = ТекущиеСтроки[0];
			Сообщить("Изменились параметры, влияющие на график поставки на склад '"+Строка(ВыборкаДетальныеЗаписи.Склад)+"' по причине: "+Строка(ВыборкаДетальныеЗаписи.Причина));
			Если ВыборкаДетальныеЗаписи.Причина = "Эстакада" Тогда
				ТекущаяСтрока.ВремяПоступления = '00010101000000';
				ТекущаяСтрока.Поток = ПредопределенноеЗначение("Справочник.ПотокиТранспортныхСредствПоставкиНаСклад.ПустаяСсылка");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
//	НачалоИнтервала = ДатаРазгрузки + (Час(ВремяПоступления)*3600+ Минута(ВремяПоступления)*60);
//	КонецИнтервала = ДатаРазгрузки + (Час(ВремяПоступления)*3600+ Минута(ВремяПоступления)*60+ПродолжительностьРазгрузки*60); 
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		Если ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(НачалоИнтервала, КонецИнтервала, ВыборкаДетальныеЗаписи.НачалоИнтервала, ВыборкаДетальныеЗаписи.КонецИнтервала) ИЛИ ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(ВыборкаДетальныеЗаписи.НачалоИнтервала, ВыборкаДетальныеЗаписи.КонецИнтервала, НачалоИнтервала, КонецИнтервала) Тогда
//			РезультатПроверки.ИнтервалДоступен = Ложь;
//			РезультатПроверки.СброситьВремя = Истина;
//		КонецЕсли;
//	КонецЦикла;
//	
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	 ДобавитьКДате(ДобавитьКДате(РасписаниеСкладскихПотоковСрезПоследних.ДатаДоставки, час, Час(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала)), минута, минута(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала)) КАК НачалоИнтервала,
//	|	ДобавитьКДате(ДобавитьКДате(РасписаниеСкладскихПотоковСрезПоследних.ДатаДоставки, час, Час(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала)), минута, минута(РасписаниеСкладскихПотоковСрезПоследних.НачалоИнтервала)+ РасписаниеСкладскихПотоковСрезПоследних.ПродолжительностьИнтервала) как КонецИнтервала 
//	|ИЗ
//	|	РегистрСведений.РасписаниеСкладскихПотоков.СрезПоследних(
//	|			,
//	|			ДатаДоставки = &Период
//	|				И Поток = &Поток) КАК РасписаниеСкладскихПотоковСрезПоследних";
//	Запрос.УстановитьПараметр("Поток", Поток);
//	УстановитьПривилегированныйРежим(Истина);
//	Результат = Запрос.Выполнить();
//	УстановитьПривилегированныйРежим(Ложь);
//	ВыборкаИнтервалов = Результат.Выбрать();
//	
//	Для каждого Строка из МассивСкладовИНормативов Цикл
//	 	СтрокиТекущегоСклада = Объект.ГруппаПоставки.НайтиСтроки(Новый Структура("Склад", Строка.Склад));
//		НачалоЗакрытогоИнтервала = НачалоДня(СтрокиТекущегоСклада[0].ДатаРазгрузки);
//		КонецЗакрытогоИнтервала = НачалоЗакрытогоИнтервала;
//		Пока ВыборкаИнтервалов.Следующий() Цикл 
//			Если НачалоЗакрытогоИнтервала = КонецЗакрытогоИнтервала Тогда
//				КонецЗакрытогоИнтервала = ВыборкаИнтервалов.НачалоИнтервала;
//			КонецЕсли;
//			Если ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(НачалоИнтервала, КонецИнтервала, НачалоЗакрытогоИнтервала, КонецЗакрытогоИнтервала) ИЛИ ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(НачалоЗакрытогоИнтервала, КонецЗакрытогоИнтервала, НачалоИнтервала, КонецИнтервала) Тогда
//				РезультатПроверки.ИнтервалДоступен = Ложь;
//			КонецЕсли;
//			НачалоЗакрытогоИнтервала = ВыборкаИнтервалов.КонецИнтервала;
//			КонецЗакрытогоИнтервала = НачалоЗакрытогоИнтервала;
//		КонецЦикла;
//		
//		КонецЗакрытогоИнтервала = КонецДня(НачалоЗакрытогоИнтервала);
//		Если ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(НачалоИнтервала, КонецИнтервала, НачалоЗакрытогоИнтервала, КонецЗакрытогоИнтервала) ИЛИ ПроверкиАльтерраСервер.ИнтервалПопалВПромежуток(НачалоЗакрытогоИнтервала, КонецЗакрытогоИнтервала, НачалоИнтервала, КонецИнтервала) Тогда
//			РезультатПроверки.ИнтервалДоступен = Ложь;
//		КонецЕсли;
//	
//		Если Строка.ПродолжительностьРазгрузки < СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки 
//			И СтрокиТекущегоСклада[0].ВремяПоступления <> '00010101000000' 
//			И СтрокиТекущегоСклада[0].ПродолжительностьРазгрузки<>0 Тогда
//			//Проверить интервал может ли располагаться в текущих границах
//			Если НЕ РезультатПроверки.ИнтервалДоступен Тогда
//				Сообщить("Из-за изменения таблицы товаров, интервал был увеличен. Необходимо выбрать время начала разгрузки вручную");
//				Если РезультатПроверки.СброситьВремя Тогда
//					СтрокиТекущегоСклада[0].ВремяПоступления = '00010101000000';
//					Поток = ПредопределенноеЗначение("Справочник.ПотокиТранспортныхСредствПоставкиНаСклад.ПустаяСсылка");
//				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ГруппаПоставкиСекцияПриИзменении(Элемент)
	ГруппаПоставкиСекцияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГруппаПоставкиСекцияПриИзмененииНаСервере()
	МассивСкладовИНормативов = Новый ТаблицаЗначений;
	МассивСкладовИНормативов.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	МассивСкладовИНормативов.Колонки.Добавить("Норматив", Новый ОписаниеТипов("СправочникСсылка.НормативыПриемкиПоставкиНаСклад"));
	МассивСкладовИНормативов.Колонки.Добавить("Поток", Новый ОписаниеТипов("СправочникСсылка.ПотокиТранспортныхСредствПоставкиНаСклад"));
	МассивСкладовИНормативов.Колонки.Добавить("ДатаНачалаИнтервала", Новый ОписаниеТипов("Дата"));
	МассивСкладовИНормативов.Колонки.Добавить("ДатаОкончанияИнтервала", Новый ОписаниеТипов("Дата"));
	МассивСкладовИНормативов.Колонки.Добавить("ПродолжительностьРазгрузки", Новый ОписаниеТипов("Число"));
	МассивСкладовИНормативов.Колонки.Добавить("Эстакада", Новый ОписаниеТипов("Булево"));
	
	Для каждого ТекущаяСтрока из Объект.ГруппаПоставки Цикл
		НоваяСтрока = МассивСкладовИНормативов.Добавить();//поправить ТЗ
		НоваяСтрока.Склад = ТекущаяСтрока.Склад;
		НоваяСтрока.Норматив = ТекущаяСтрока.Норматив;
		НоваяСтрока.Поток = ТекущаяСтрока.Поток;
		НоваяСтрока.ДатаНачалаИнтервала = ТекущаяСтрока.ДатаРазгрузки;
		НоваяСтрока.ДатаОкончанияИнтервала = ТекущаяСтрока.ДатаРазгрузки+ТекущаяСтрока.ПродолжительностьРазгрузки;
		НоваяСтрока.ПродолжительностьРазгрузки = ТекущаяСтрока.ПродолжительностьРазгрузки;
		НоваяСтрока.Эстакада = ТекущаяСтрока.Эстакада;
	КонецЦикла;

	ПроверитьИнтервалыСкладовНаДоступность(МассивСкладовИНормативов);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПоставкиДатаРазгрузкиПриИзменении(Элемент)
	ГруппаПоставкиДатаРазгрузкиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГруппаПоставкиДатаРазгрузкиПриИзмененииНаСервере()
	МассивСкладовИНормативов = Новый ТаблицаЗначений;
	МассивСкладовИНормативов.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	МассивСкладовИНормативов.Колонки.Добавить("Норматив", Новый ОписаниеТипов("СправочникСсылка.НормативыПриемкиПоставкиНаСклад"));
	МассивСкладовИНормативов.Колонки.Добавить("Поток", Новый ОписаниеТипов("СправочникСсылка.ПотокиТранспортныхСредствПоставкиНаСклад"));
	МассивСкладовИНормативов.Колонки.Добавить("ДатаНачалаИнтервала", Новый ОписаниеТипов("Дата"));
	МассивСкладовИНормативов.Колонки.Добавить("ДатаОкончанияИнтервала", Новый ОписаниеТипов("Дата"));
	МассивСкладовИНормативов.Колонки.Добавить("ПродолжительностьРазгрузки", Новый ОписаниеТипов("Число"));
	МассивСкладовИНормативов.Колонки.Добавить("Эстакада", Новый ОписаниеТипов("Булево"));
	
	Для каждого ТекущаяСтрока из Объект.ГруппаПоставки Цикл
		НоваяСтрока = МассивСкладовИНормативов.Добавить();//поправить ТЗ
		НоваяСтрока.Склад = ТекущаяСтрока.Склад;
		НоваяСтрока.Норматив = ТекущаяСтрока.Норматив;
		НоваяСтрока.Поток = ТекущаяСтрока.Поток;
		НоваяСтрока.ДатаНачалаИнтервала = ТекущаяСтрока.ДатаРазгрузки;
		НоваяСтрока.ДатаОкончанияИнтервала = ТекущаяСтрока.ДатаРазгрузки+ТекущаяСтрока.ПродолжительностьРазгрузки;
		НоваяСтрока.ПродолжительностьРазгрузки = ТекущаяСтрока.ПродолжительностьРазгрузки;
		НоваяСтрока.Эстакада = ТекущаяСтрока.Эстакада;
	КонецЦикла;

	ПроверитьИнтервалыСкладовНаДоступность(МассивСкладовИНормативов);
	Объект.ДатаПрибытияНаСклад = ПолучитьМинимальнуюДатуПогруппеПоставки(Объект.ГруппаПоставки.Выгрузить(, "ДатаРазгрузки"));
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ПроверкаНаДатыПоСкладу() Тогда
			Отказ = Истина;
		КонецЕсли;
		ЗаписатьИнтервалДоставкиСервер();
		Документы.РейсСиламиПоставщика.ОбновитьВремяИИнтервалПоставки(Объект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаНаДатыПоСкладу()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РейсСиламиПоставщикаОснования.Документ.Склад КАК ДокументСклад,
		|	РейсСиламиПоставщикаОснования.Документ КАК Документ,
		|	РейсСиламиПоставщикаОснования.Документ.ДатаПоступления КАК ДатаПоступления
		|ИЗ
		|	Документ.РейсСиламиПоставщика.Основания КАК РейсСиламиПоставщикаОснования
		|ГДЕ
		|	РейсСиламиПоставщикаОснования.Ссылка = &Ссылка
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДатаПоступления)
		|ПО
		|	ДокументСклад";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокументСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументСклад.Следующий() Цикл
		Если ВыборкаДокументСклад.ДатаПоступления > 1 Тогда
			Сообщить("По складу "+Строка(ВыборкаДокументСклад.ДокументСклад)+" добавлены заказы с разными датами поступления. Проведение документа отменено");
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПолучитьЗаказПоставщикуПоПриобретению(Приобретение)
	Объект.Стоимость = Объект.Стоимость+Приобретение.СуммаДокумента;
	Возврат Приобретение.ЗаказПоставщику;
КонецФункции

&НаСервере
Функция ПолучитьМинимальнуюДатуПогруппеПоставки(ГруппаПоставки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.ДатаРазгрузки КАК ДатаРазгрузки
		|ПОМЕСТИТЬ ВТДатыЗаказов
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВТДатыЗаказов.ДатаРазгрузки) КАК ДатаРазгрузки
		|ИЗ
		|	ВТДатыЗаказов КАК ВТДатыЗаказов";
	
	Запрос.УстановитьПараметр("ТЗ", ГруппаПоставки);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ДатаРазгрузки;
	КонецЕсли;
	
	Возврат Объект.ДатаПрибытияНаСклад;
КонецФункции

&НаСервере
Процедура ЗаполнитьПотокиПоСкладам()
	СписокСекций = Новый Массив;
	Для каждого Строка из Объект.ГруппаПоставки Цикл
		СписокСекций.Добавить(Строка.Секция);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Ссылка КАК Поток,
		|	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Секция.Владелец КАК Склад
		|ИЗ
		|	Справочник.ПотокиТранспортныхСредствПоставкиНаСклад.Секции КАК ПотокиТранспортныхСредствПоставкиНаСкладСекции
		|ГДЕ
		|	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Секция В(&Секция)
		|	И ПотокиТранспортныхСредствПоставкиНаСкладСекции.Ссылка.Наименование ПОДОБНО ""%Осн""";
	
	Запрос.УстановитьПараметр("Секция", СписокСекций);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокиТекущегоСклада = Объект.ГруппаПоставки.НайтиСтроки(Новый Структура("Склад", ВыборкаДетальныеЗаписи.Склад));
		Если СтрокиТекущегоСклада.Количество() > 0 Тогда
			ТекущаяСтрока = СтрокиТекущегоСклада[0];
			ТекущаяСтрока.Поток = ВыборкаДетальныеЗаписи.Поток;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьПотокПоСекции(Секция)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Ссылка КАК Поток
		|ИЗ
		|	Справочник.ПотокиТранспортныхСредствПоставкиНаСклад.Секции КАК ПотокиТранспортныхСредствПоставкиНаСкладСекции
		|ГДЕ
		|	ПотокиТранспортныхСредствПоставкиНаСкладСекции.Секция = &Секция";
	
	Запрос.УстановитьПараметр("Секция", Секция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Поток;
	КонецЕсли;
	Возврат Справочники.ПотокиТранспортныхСредствПоставкиНаСклад.ПустаяСсылка();
КонецФункции

&НаСервере
Процедура ПроверитьИзменениеСеткиПоставок()
	ГруппаПоставкиДоИзменения = Объект.Ссылка.ГруппаПоставки.Выгрузить();
	Документы.РейсСиламиПоставщика.ЗаполнитьГруппуПоставки(Объект);
	
	Для каждого Строка из Объект.ГруппаПоставки Цикл
		МассивСтрок = ГруппаПоставкиДоИзменения.НайтиСтроки(Новый Структура("Склад", Строка.Склад));
		Если МассивСтрок.Количество()>0 Тогда
			СтрокаДоИзменений = МассивСтрок[0];
			Если СтрокаДоИзменений.Секция <> Строка.Секция
				ИЛИ СтрокаДоИзменений.ПродолжительностьРазгрузки <> Строка.ПродолжительностьРазгрузки Тогда
					
				Строка.ВремяПоступления = '00010101000000';
				Строка.Поток = ПредопределенноеЗначение("Справочник.ПотокиТранспортныхСредствПоставкиНаСклад.ПустаяСсылка");
				
				Если Строка.ДатаРазгрузки <> '00010101' Тогда
					Модифицированность = Истина;		
					ПараметрыЗаписи = Новый Соответствие;
					ОсновнойПоток = ПолучитьПотокПоСекции(СтрокаДоИзменений.Секция);
					ЗначениеПараметров = Новый Структура;
					ЗначениеПараметров.Вставить("Поток", ОсновнойПоток);
					ЗначениеПараметров.Вставить("ЗаказПоставщику", Объект.Ссылка);
					ЗначениеПараметров.Вставить("ДатаВремяРазгрузкиПлан", СтрокаДоИзменений.ДатаРазгрузки + Минута(СтрокаДоИзменений.ВремяПоступления)*60 + Час(СтрокаДоИзменений.ВремяПоступления)*3600);
					ЗначениеПараметров.Вставить("ПродолжительностьРазгрузки", СтрокаДоИзменений.ПродолжительностьРазгрузки);
					ЗначениеПараметров.Вставить("СогласованоСоСкладом", СтрокаДоИзменений.СогласованоСоСкладом);
					ЗначениеПараметров.Вставить("ТекстПоставки", СтрокаДоИзменений.ПримечаниеКПоставке);
					ЗначениеПараметров.Вставить("Склад", СтрокаДоИзменений.Склад);
					ЗначениеПараметров.Вставить("Оборудование", ?(СтрокаДоИзменений.Эстакада, ПолучитьЭстакаду(Истина), ПолучитьЭстакаду(Ложь)));
					ПараметрыЗаписи.Вставить(Объект.Ссылка, ЗначениеПараметров);
					//Альтерра_СеткаПоставок.ИзменитьДанныеСеткиПоставок(Объект.Ссылка, "Удаление",  ПараметрыЗаписи, Истина, СтрокаДоИзменений.Склад, Альтерра_СеткаПоставок.ПолучитьДопПотокиПоСкладу(СтрокаДоИзменений.Склад, Объект.Ссылка, ОсновнойПоток));
					Сообщить("Для склада '"+Строка(Строка.Склад)+"' изменились данные поставки. Необходимо заново запланировать поставку.")
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьЗаказыПоставщика(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодобратьЗаказыПоставщикаЗавершение", ЭтаФорма);
	ОчиститьСообщения();
	ОткрытьФорму("Документ.ЗаказПоставщику.Форма.Док_ФормаВыбораПоставки",,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	//ПодобратьЗаказыПоставщикаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьЗаказыПоставщикаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ЗаполнитьТаблицуОснованийСФормыВыбора(Результат);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОснованийСФормыВыбора(Результат)
	Документы.РейсСиламиПоставщика.ЗаполнитьДанныеПоОснованию(Результат, Объект);
	ПроверитьИзменениеСеткиПоставок();
	ЗаполнитьПотокиПоСкладам();
КонецПроцедуры

#КонецОбласти
